In [1]:
import numpy as np
import pandas as pd
import sqlalchemy
import matplotlib as plt
import matplotlib.pyplot as plt

from comm.factor_util import FactorUtil

In [2]:
#tick_df = FactorUtil.read_tick_from_sql('FG2409', '20240101', '00:00:00', 100)
#tick_df.head()

In [3]:
# bar_df = FactorUtil.read_bar_from_sql('FG2409_MIN_1', '20240101', '00:00:00', 100)
# bar_df.head()

In [4]:
# window function
# bar_df.count()

In [5]:
bar_df_1 = FactorUtil.get_bar_df('FG2409_MIN_1', '20240101', '00:00:00', 100)
bar_df_1.head()

,O,H,L,C,V,AP,AV,BP,BV
ts,,,,,,,,,
2024-04-08 09:00:00,1460.0,1468.0,1458.0,1461.0,57951,1463.564,21381,1461.706,29890
2024-04-08 09:01:00,1462.0,1466.0,1462.0,1466.0,22362,1464.687,32500,1463.319,22759
2024-04-08 09:02:00,1465.0,1472.0,1465.0,1466.0,20711,1469.229,31313,1468.349,29256
2024-04-08 09:03:00,1465.0,1469.0,1465.0,1467.0,11244,1468.913,34348,1467.494,23949
2024-04-08 09:04:00,1466.0,1467.0,1460.0,1461.0,12404,1462.871,15434,1461.744,33010

In [6]:
bar_df_2 = FactorUtil.get_window_bar_df('FG2409_MIN_1', '20240101', '00:00:00', 100, 5)
bar_df_2[['O_4', 'H_4', 'O_3', 'H_3', 'O_2', 'H_2', 'O_1', 'H_1', 'O', 'H']].head()

,O_4,H_4,O_3,H_3,O_2,H_2,O_1,H_1,O,H
ts,,,,,,,,,,
2024-04-08 09:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1460.0,1468.0
2024-04-08 09:01:00,NaN,NaN,NaN,NaN,NaN,NaN,1460.0,1468.0,1462.0,1466.0
2024-04-08 09:02:00,NaN,NaN,NaN,NaN,1460.0,1468.0,1462.0,1466.0,1465.0,1472.0
2024-04-08 09:03:00,NaN,NaN,1460.0,1468.0,1462.0,1466.0,1465.0,1472.0,1465.0,1469.0
2024-04-08 09:04:00,1460.0,1468.0,1462.0,1466.0,1465.0,1472.0,1465.0,1469.0,1466.0,1467.0